# SupportsRevealConstraints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..SupportsRevealConstraints Method
View Class See Also
---
Checks that the view can have the Reveal Constraints mode activated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool SupportsRevealConstraints()
```

Visual Basic
---
```text
Public Function SupportsRevealConstraints As Boolean
```

Visual C++
---
```text
public:
bool SupportsRevealConstraints()
```

# ### Return Value
True if the view has a view type that allows Reveal Constraints mode to be activated.
# Remarks
Reveal Constraints mode can only be activated for the following viewtypes:
  * 3D Views
  * Area Plans
  * Ceiling Plans
  * Detail Views
  * Drafting Views
  * Elevations
  * Floor Plans
  * Sections
  * Structural Plans

# See Also
View Class
Autodesk.Revit.DB Namespace